r"""
This file is meant to catch errors in the PARI/GP package which are not
caught by any other tests.

Check that :trac:`9876` has been fixed, this test comes from PARI's
self-test "rnfkummer"::

    sage: pari('setrand(1); lift(rnfkummer(bnrinit(bnfinit(y^4-52*y^2+26,1),3,1),Mat(5)))')  # long time (4s on sage.math, 2011)
    x^5 + (677308732982301944730030845266716201702837696162187325328/5*y^3 + 481271319660811460139352501916644558975058261230836596652/5*y^2 - 34878079733048511269299413306183851642254427026365686673888/5*y - 24783137893632185532697291886880720222932490781434136563942/5)*x^3 + (3121825424585613564828729670704559492032765858876683224121119983801219547643890505070*y^3 + 2218259473949490736667831079912338956828105689590705243343986337391928943383709808005*y^2 - 160758704836112475349193472119432636971334139776148581364333958289434482806877560648970*y - 114229487928172801039731551289054638597376141715926648946031483976252167029243247022480)*x^2 + (-166692999053535356002572927874917139211874871730209960830468398970597547702137238176414705764356470658863661934844/5*y^3 - 118446188915971905087412803032726595730394344242831753676734791550346393669679117451359918013807557809143042588696/5*y^2 + 8583872250159852857479162156889677342550132950704205078118190632176525884150800135006242479797595396229858998666474/5*y + 6099398054781102460046012340322433264871600802691098946100231203424708988718659688581036467351459717869466864403491/5)*x + (-3761942859516698460017771578887550299728643548425212623644925442305118051299870709569967640457662697840860989973276516003636843449764721490044/5*y^3 - 2673104432455463952284352656647109245231103663592899118247897745294025980581570350460813923435311458682114748384710825808171997155877533243621/5*y^2 + 193721614595917576607166927238849546114076202473503220710707213556396586084964322202670927424345172110316287310450443586757567876756951302594424/5*y + 137651773558650909762864388498297831958827163349141150095186154867116600261791580542516653158613689676015829782898702530873665348851222173825666/5)

Check that :trac:`10195` (PARI bug 1153) has been fixed::

    sage: print gp.eval("mathnf([0,0,0,0,0,0,0,0,0,13;0,0,0,0,0,0,0,0,23,6;0,0,0,0,0,0,0,23,-4,-7;0,0,0,0,0,0,17,-3,5,-5;0,0,0,0,0,56,16,-16,-15,-17;0,0,0,0,57,24,-16,-25,2,-21;0,0,0,114,9,56,51,-52,25,-55;0,0,113,-31,-11,24,0,28,34,-16;0,50,3,2,16,-6,-2,7,-19,-21;118,43,51,23,37,-52,18,38,51,28],0)")
    [787850171872400 32189386376004 356588299060422 742392731867995 282253457851430 665185047494955 664535243562463 744564809133574 113975061998590 527459013372200]
    [0 12 6 11 5 3 7 6 6 0]
    [0 0 3 1 2 1 1 0 0 0]
    [0 0 0 1 0 0 0 0 0 0]
    [0 0 0 0 1 0 0 0 0 0]
    [0 0 0 0 0 1 0 0 0 0]
    [0 0 0 0 0 0 1 0 0 0]
    [0 0 0 0 0 0 0 1 0 0]
    [0 0 0 0 0 0 0 0 1 0]
    [0 0 0 0 0 0 0 0 0 1]

Check that :trac:`11604` (PARI bug 1154) has been fixed::

    sage: A = Matrix(ZZ,4,4,[32982266684193100, 1368614777139719, 224591013270052693, 276460184982223238,1368614777139719,  56791380087354, 9319512049770279, 11471848267545007,224591013270052693, 9319512049770279,1529340971891522140, 1882541434053596358,276460184982223238, 11471848267545007, 1882541434053596358, 2317313350044091414])
    sage: pari(A).qfminim(2,0)
    [0, 0, [;]]

Check :trac:`13314`, the following should not give a
Segmentation Fault::

    sage: x = polygen(ComplexField(128))
    sage: p = x^84 + (16*x^4 - 1)^20 * (2^48*x^4 - 2049^4)
    sage: len(pari(p).polroots(precision=128))
    84

Check that the optional PARI databases work::

    sage: gp.ellinit('"299998a1"')  # optional -- database_pari
    [1, 0, 1, 110, -3660, ...]
    sage: E = EllipticCurve("1728ba1")
    sage: gp(E).ellidentify()  # optional -- database_pari
    [["1728ba1", [0, 0, 0, -6, 6], [[1, 1]]], [1, 0, 0, 0]]

    sage: pari("ellmodulareqn(211)")  # optional -- database_pari
    [x^212 + (-y^7 + 5207*y^6 - 10241606*y^5 + 9430560101*y^4 - 4074860204015*y^3 + 718868274900397*y^2 - 34897101275826114*y + 104096378056356968)*x^211...

The following requires the modular polynomials up to degree 223, while
only those up to degree 199 come standard in Sage::

    sage: p = next_prime(2^328)
    sage: E = EllipticCurve(GF(p), [6,1])
    sage: E.cardinality()  # long time (108s on sage.math, 2013), optional -- database_pari
    546812681195752981093125556779405341338292357723293496548601032930284335897180749997402596957976244

Create a number field with Galois group `A4`. Group `A4` corresponds to
transitive group `(12,3)` in GAP::

    sage: R.<x> = PolynomialRing(ZZ)
    sage: pol = pari("galoisgetpol(12,3)[1]")  # optional -- database_pari
    sage: K.<a> = NumberField(R(pol))  # optional -- database_pari
    sage: factor(K.discriminant())  # optional -- database_pari
    163^8
    sage: [F.degree() for F,a,b in K.subfields()]  # optional -- database_pari
    [1, 3, 4, 4, 4, 4, 6, 6, 6, 12]
    sage: sorted([12/H.cardinality() for H in AlternatingGroup(4).subgroups()])
    [1, 3, 4, 4, 4, 4, 6, 6, 6, 12]
"""
